<!--
 * @Author: your name
 * @Date: 2021-05-08 14:50:02
 * @LastEditTime: 2021-05-08 15:20:33
 * @LastEditors: Please set LastEditors
 * @Description: In User Settings Edit
 * @FilePath: \inventory-apie:\hjimi\人脸辨识云\html\gitee\pc\faceCloudWebsite\src\views\privacy\privacy.vue
-->
<style scoped lang="scss">
	.bold {
		font-weight: bold;
		line-height: 20px;
		padding: 10px 0;
	}
	p {
		line-height: 20px;
		display: block;
	}
	.container {
		height: 81.5vh;
		overflow: hidden;
		overflow-y: auto;
	&::-webkit-scrollbar-track {
    background: #efefef;
    border-radius: 10px;
}
&::-webkit-scrollbar-thumb {
    background: #87c3ff;
    border-radius: 10px;
}
&::-webkit-scrollbar {
    width: 5px;
}
	}
</style>
<template>
	<div>
		<div class="container">
			<div class="bold">一、前言</div>

			<p>我们非常重视保护用户的个人隐私，保护用户的个人信息，希望与大家用户之间建立和谐的互相信任的关系。</p>

			<p>在您在使用我们及旗下各应用服务时，我们可能会收集和使用您的一些相关信息。在此，我们将通过本《隐私政策》向您说明，在我们提供服务的过程中可能会是如何收集、使用、储存相关这些信息，以及我们将为您提供的控制和如何保护这些信息和您的隐私安全的方式。本《隐私保护政策》与您所使用的我们服务息息相关，希望您仔细阅读。在您使用或继续使用我们的应用或服务，即表明您同意我们按照本《隐私保护政策》收集、使用、储存您的相关信息。</p>

			<div class="bold">二、我们可能收到的信息</div>

			<p>在您使用我们客户端产品或服务的过程中，我们会收集部分使用信息并发往我们的服务器。我们的服务器收到的信息可划分为两类，一类是关于用户如何使用我们产品的信息，另外一类是用户所拥有数据的汇总统计信息。我们收集信息是为了向所有用户提供更好的服务。</p>
			<p>我们有两种信息收集方式：</p>

			<div class="bold">（一）您向我们提供的信息</div>

			<p>•当您授权应用时，我们可能会要求您提供个人信息，例如姓名，昵称，电子邮件，身份证信息，以及其他个人信息，以向您提供完整的服务或技术支持。</p>

			<p>•您通过我们的服务向其他方分享的信息，以及其他通过我们的服务主动存储的信息。</p>

			<div class="bold">（二）我们在您使用服务的过程中获取的信息</div>

			<p>我们会收集关于您使用的服务以及使用方式的信息，以下具体介绍我们产品可能会获得什么信息。</p>

			<p>1、日志信息。指您使用我们的服务时，系统自动采集的技术信息，包括：</p>

			<p>硬件配置及软件版本。例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码（IMEI）；</p>

			<p>手机中数据的整体统计信息。手机中数据的整体统计信息。例如，访问你在通讯录中有多少个联系人？访问你的相机，麦克风，帐户，电话号码等数据同步、分享和储存。我们提供的某些服务允许您同步、分享和储存数据，我们将会收集并储存您选择要上传、下载或实现这类功能的数据（例如对您上传的图片进行算法分析）。</p>

			<p>2、位置信息。指您开启移动终端设备定位功能并使用我们基于位置提供的相关服务时，我们收集的有关您位置的信息，包括：</p>

			<p>通过具有定位功能的移动设备使用我们的服务时，我们通过GPS或Wi-Fi等方式收集的您的地理位置信息；</p>

			<p>您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息，例如您或其他人共享的照片包含的地理标记信息；</p>

			<p>您可以通过关闭定位功能随时停止我们对您的地理位置信息的收集。</p>

			<div class="bold">三、我们如何使用您的个人信息</div>

			<p>我们将严格遵守本隐私政策及其更新所载明的内容来使用您的个人信息。您的个人信息将仅用于收集时即已确定并且经过您同意的目的，如有除此之外的任何其他用途，我们都会提前征得您的同意。</p>

			<p>•我们收集的个人信息将被用于确保我们产品和服务的功能和安全、验证您的身份、防止并追究欺诈或其他不当使用的情形。</p>
			<p>•我们收集的个人信息将被用于我们的产品和服务开发，尽管一般情况下，我们为此目的仅使用综合信息和统计性信息。</p>
			<p>•我们收集的个人信息将被用于与您进行交流，例如，在我们产品或服务更新、发布的第一时间向您发出通知。</p>
			<p>•我们所收集的个人信息将被用于进行产品的个性化设计，并向您提供更为贴身的服务，例如：在我们的服务中自动进行推荐、展示专为您打造的内容和推广。</p>
			<p>•如果您参与我们举办各类活动，我们会将您提供的个人信息用于管理此类活动。</p>
			<div class="bold">四、非个人信息的使用</div>

			<p>对于我们收集的本身无法与任何特定个人直接建立联系的数据，诸如使用偏好、硬件配置、位置信息、软件操作信息等，可以帮助我们更好地了解用户行为，改进我们的产品、服务和推广宣传。 </p>
			<p>对于您通过我们服务分享的其他信息，例如收藏并分享的应用信息等内容会根据具体产品的需要分享给第三方使用。 </p>

			<div>我们或我们的关联公司还可能为以下需要而使用或披露您的个人信息：</div>

			<p>•遵守适用的法律法规；</p>

			<p>•遵守法院命令或其他法律程序的规定；</p>
			<p>•遵守相关政府机关的要求；</p>
			<p>•为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们或我们的集团公司、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途。</p>
			<div class="bold">五、未成年人信息保护</div>

			<p>我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。</p>

			<div class="bold">六、信息安全</div>

			<p>我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。但请您理解，由于技术的限制以及可能存在的网络恶意手段，我们虽然尽力保护信息的安全，但是不可能始终保证信息的绝对安全。</p>

			<div class="bold">七、隐私政策的适用范围</div>

			<p>本《隐私政策》适用我们应用内的所有服务。但是针对某些特定服务的隐私政策，我们将更具体地说明在该等服务中如何使用您的信息。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。</p>

			<p>请您注意，本《隐私政策》不适用于以下情况：</p>
			<p>•通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；</p>
			<p>•通过在我们服务中进行推广服务的其他公司或机构所收集的信息。</p>
			<div class="bold">九、变更</div>

			<p>我们可能适时修订本《隐私政策》的条款，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在向您进行通知之后，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。</p>
			<div class="bold">十、联系我们</div>
			<p>北京华捷艾米科技有限公司</p>
			<p>联系地址：北京市海淀区宝盛南路一号院奥北科技园 四号楼</p>
			<p>电话：010-62981342</p>
			<p>邮箱：BD@hjimi.com</p>
		</div>
		</div>
</template>